schemas = {
    "旅行家G20": {
        "基本参数": ["车系", "车型", "能源类型", "市场指导价", "上市时间", '停售', "座位数", "轴距", "尺寸", "发动机型式", "发动机排量", "发动机排放标准", "发动机额定功率", "发动机最大扭矩", "变速箱", "燃油", "燃油箱容积", "尿素罐容积", "驱动形式", "前后悬架", "双侧滑移门", "清水箱", "灰水箱", "电能系统"],
        "安全性配置": ["车身电子稳定系统", "360全景影像", "前后雷达", "胎压监测", "主副驾安全气囊", "儿童座椅安装点", "外后视镜", "灭火器"],
        "外观与内饰": ["外观颜色", "车身贴花", "内饰颜色", "对向卡座", "一体式橱柜", "车尾抽拉式淋浴水龙头", "主驾八向电动座椅", "副驾四向手动调节座椅", "天窗", "LED前阅读灯", "氛围灯", "LED自动感应前大灯", "日间行车灯", "天空之境流光LED尾灯", "轮胎"],
        "舒适与便利": ["上汽阿里斑马智行互联系统", "触控大屏", "八喇叭车载扬声系统", "驾驶模式", "电动助力转向", "电子驻车制动", "Autohold自动驻车系统", "智能遥控钥匙", "发动机自动启停系统", "无钥匙进入及一键启动", "真皮多功能方向盘", "定速巡航", "前后独立自动空调", "智能感应雨刮", "电动升顶帐篷", "水电控制面板", "插座", "开关", "车内照明系统", "重力加水口", "市电充电口", "外置抽拉厨房", "外置抽拉厨房", "外置抽拉厨房", "户外椅子"]
                },

    "旅行家V80": {
        "基本参数": ["车系", "车型", "能源类型", "市场指导价", "上市时间", "停售", "座位数", "轴距", "尺寸", "发动机型式", "发动机排量", "发动机排放标准", "发动机额定功率", "发动机最大扭矩", "变速箱", "驱动形式", "后轮胎形式", "最高车速", "燃油", "燃油箱容积", "尿素罐容积", "制动系统", "悬架系统", "轮胎规格", "车载冰箱", "清水箱", "灰水箱"],
        "安全性配置": ["车身电子稳定系统", "主副驾安全气囊", "乘客区座椅三点式安全带", "儿童座椅安装点", "倒车雷达", "胎压监测", "倒车影像", "发动机电子芯片防盗系统", "烟雾报警器", "烟雾报警器", "灭火器"],
        "外观与内饰": ["外观颜色", "内饰风格", "卤素前大灯", "雾灯", "主副驾驶座椅180度旋转", "手动升降餐桌", "一体式橱柜", "一体式卫生间", "侧窗", "电动踏步", "铝合金轮毂", "遮阳篷", "照明系统", "开关插座"],
        "舒适与便利": ["蜘蛛智联车联网", "娱乐主机", "多功能方向盘", "液压动力转向", "电子手刹", "电动电加热外后视镜", "定速巡航", "遥控钥匙", "行车空调", "驻车加热系统", "驻车空调", "智能触屏电视", "重力加水口", "外接市电口", "外置卡式炉", "自行车架", "尾部爬梯", "太阳能电池板", "电动升降餐桌", "动中通卫星接收器"]
                },

    "旅行家V90": {
        "基本参数": ["车系", "车型", "能源类型", "市场指导价", "上市时间", "停售", "座位数", "外观尺寸", "床铺尺寸", "发动机型式", "发动机排量", "发动机排放标准", "发动机额定功率", "发动机最大扭矩", "变速箱", "驱动形式", "后轮胎形式", "最高车速", "燃油", "燃油箱容积", "尿素罐容积", "制动系统", "悬架系统", "轮胎", "清水箱", "灰水箱", "车载冰箱", "扬声器个数", "钥匙", "蜘蛛智联车联网", "驾驶舱中控屏", "生活舱集控屏", "电能系统"],
        "安全性配置": ["车身电子稳定系统", "主副驾安全气囊", "乘客区座椅三点式安全带", "儿童座椅安装点", "雷达", "胎压监测", "倒车影像", "发动机电子芯片防盗系统", "流媒体后视镜", "烟雾报警器", "一氧化碳报警器", "灭火器"],
        "外观与内饰": ["灭火器", "外观颜色", "内饰风格", "原厂专属标识套件", "自动感应LED大灯", "雾灯", "主副驾驶座椅180度旋转", "一体式橱柜", "一体式卫生间", "侧窗", "电动踏步", "铝合金轮毂", "遮阳篷", "外置抽拉卡式炉", "照明系统"],
        "舒适与便利": ["多功能方向盘", "电子助力转向", "三模驾驶模式", "电动电加热外后视镜", "定速巡航", "行车空调", "直流变频空调", "驻车加热系统", "智能触屏电视", "开关", "插座", "重力加水口", "外接市电口", "智能无忧包", "用电无忧包", "用电旗舰包", "太阳能电池板", "固定式餐桌", "电动升降式餐桌", "随动式纱门", "动中通卫星接收器"]
                },

    "生活家V90": {
        "基本参数": ["车系", "车型", "能源类型", "上市时间", "停售", "市场指导价", "座位数", "轴距", "外观尺寸", "尾床尺寸", "额头床尺寸", "发动机型式", "发动机排量", "发动机排放标准", "发动机额定功率", "发动机最大扭矩", "变速箱", "驱动形式", "后轮胎形式", "最高车速", "燃油箱容积", "尿素罐容积", "制动系统", "悬架系统", "轮胎", "清水箱", "灰水箱", "车载冰箱", "扬声器个数", "钥匙", "蜘蛛智联车联网", "驾驶舱中控屏", "生活舱集控屏", "电能系统"],
        "安全性配置": ["车身电子稳定系统", "主副驾安全气囊", "乘客区座椅三点式安全带", "儿童座椅安装点", "雷达", "胎压监测", "倒车影像", "发动机电子芯片防盗系统", "高级驾驶辅助系统", "流媒体后视镜", "智能交流配电盒", "烟雾报警器", "一氧化碳报警器", "灭火器"],
        "外观与内饰": ["外观颜色", "内饰风格", "原厂专属标识套件", "自动感应LED大灯", "雾灯", "主副驾驶座椅180度旋转", "对向卡座", "卡座", "电动升降式餐桌", "卡座电动升降窗", "一体式橱柜", "一体式卫生间", "天窗", "侧窗", "乘客舱门", "电动踏步", "遮阳篷", "贯通储物舱", "外置厨房", "车尾自行车架和爬梯安装孔位", "照明系统", "氛围灯"],
        "舒适与便利": ["一键启动及无钥匙进入", "多功能方向盘", "电子助力转向", "三模驾驶模式", "自动前雨刮", "电动电加热外后视镜", "行车空调", "直流变频空调", "驻车加热系统", "智能触屏电视", "开关", "插座", "重力加水口", "标准市电口", "大额头用电旗舰包", "小额头用电旗舰包", "大额头用电无忧包", "小额头用电无忧包", "舒享家居包", "三路流媒体后视镜", "限高防撞预警", "太阳能电池板", "动中通卫星接收器"]
                },

    "生活家V90小额头": {
        "基本参数": ["车系", "车型", "能源类型", "上市时间", "停售", "市场指导价", "座位数", "轴距", "外观尺寸", "尾床尺寸", "额头床尺寸", "发动机型式", "发动机排量", "发动机排放标准", "发动机额定功率", "发动机最大扭矩", "变速箱", "驱动形式", "后轮胎形式", "最高车速", "燃油箱容积", "尿素罐容积", "制动系统", "悬架系统", "轮胎", "清水箱", "灰水箱", "车载冰箱", "扬声器个数", "钥匙", "蜘蛛智联车联网", "驾驶舱中控屏", "生活舱集控屏", "电能系统"],
        "安全性配置": ['车身电子稳定系统', '主副驾安全气囊', '乘客区座椅三点式安全带', '儿童座椅安装点', '雷达', '胎压监测', '倒车影像', '发动机电子芯片防盗系统', '高级驾驶辅助系统', '流媒体后视镜', '智能交流配电盒', '烟雾报警器', '一氧化碳报警器', '灭火器'],
        "外观与内饰": ['外观颜色', '内饰风格', '原厂专属标识套件', '自动感应LED大灯', '雾灯', '主副驾驶座椅180度旋转', '对向卡座', '卡座', '电动升降式餐桌', '卡座电动升降窗', '一体式橱柜', '一体式卫生间', '天窗', '侧窗', '乘客舱门', '电动踏步', '遮阳篷', '贯通储物舱', '外置厨房', '车尾自行车架和爬梯安装孔位', '照明系统', '氛围灯'],
        "舒适与便利": ['多功能方向盘', '电子助力转向', '三模驾驶模式', '自动前雨刮', '电动电加热外后视镜', '行车空调', '直流变频空调', '驻车加热系统', '智能触屏电视', '开关', '插座', '重力加水口', '标准市电口', '大额头用电旗舰包', '小额头用电旗舰包', '大额头用电无忧包', '小额头用电无忧包', '舒享家居包', '三路流媒体后视镜', '限高防撞预警', '太阳能电池板', '动中通卫星接收器']
                    },

    "生活家V90别墅版": {
        "基本参数": ['车系', '车型', '能源类型', '上市时间', '停售', '市场指导价', '座位数', '轴距', '外观尺寸', '尾床尺寸', '额头床尺寸', '发动机型式', '发动机排量', '发动机排放标准', '发动机额定功率', '发动机最大扭矩', '变速箱', '驱动形式', '后轮胎形式', '最高车速', '燃油箱容积', '尿素罐容积', '制动系统', '悬架系统', '轮胎', '清水箱', '灰水箱', '车载冰箱', '扬声器个数', '钥匙', '蜘蛛智联车联网', '驾驶舱中控屏', '生活舱集控屏', '电能系统'],
        "安全性配置": ['车身电子稳定系统', '主副驾安全气囊', '乘客区座椅三点式安全带', '儿童座椅安装点', '雷达', '胎压监测', '倒车影像', '发动机电子芯片防盗系统', '高级驾驶辅助系统', '流媒体后视镜', '智能交流配电盒', '烟雾报警器', '一氧化碳报警器', '灭火器'],
        "外观与内饰": ['外观颜色', '内饰风格', '原厂专属标识套件', '自动感应LED大灯', '雾灯', '主副驾驶座椅180度旋转', '对向卡座', '卡座', '电动升降式餐桌', '卡座电动升降窗', '一体式橱柜', '一体式卫生间', '天窗', '侧窗', '电动踏步', '遮阳篷', '贯通储物舱', '外置厨房', '车尾自行车架和爬梯安装孔位', '照明系统', '氛围灯'],
        "舒适与便利": ['多功能方向盘', '电子助力转向', '三模驾驶模式', '自动前雨刮', '电动电加热外后视镜', '行车空调', '直流变频空调', '驻车加热系统', '智能触屏电视', '开关', '插座', '重力加水口', '标准市电口', '大额头用电旗舰包', '小额头用电旗舰包', '大额头用电无忧包', '小额头用电无忧包', '舒享家居包', '三路流媒体后视镜', '限高防撞预警', '太阳能电池板', '动中通卫星接收器']
                    },
           }